Revit 2024 API
BuiltInFailures.MassFailures.CannotIntegrate Property
 In order to restore an element's 'Constrain to Massing' property to 'Dependent', it must be in the main model with the massing.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotIntegrate { get; }
Visual Basic
Public Shared ReadOnly Property CannotIntegrate As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotIntegrate {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.MassFailures Class
Autodesk.Revit.DB Namespace